# 숫자형    

# 정수형(integer) : 정수를 뜻하는 자료형    
```python
a = 123   
a = -123   
a = 0
```      

# 실수형(floating-porin) : 소수점이 포함된 숫자
```python
a = 1.2    
a = -3.45
```    

# 사칙연산    
```python
a = 3   
b = 4   
a + b = 7    
a - b = -1   
a * b = 12   
a / b = 0.75
```   
    
# 제곱 연산자 : **          
```python
a = 3   
b = 4   
a ** b = 3^4 = 81
```   
   
# 나머지 반환 연산자 : %        
```python
7 % 3 = 1   
3 % 7 = 3
```     
      
# 몫 반환 연산자 : //    
```python
7 / 4 = 1.75
7 // 4 = 1
```         
       
# 복합 연산자 : 산술연산자(+, -)에 대입연산자(=) 합쳐 놓은 것   
```python
a = 1   
a = a + 1    
print(a) = 2     

a += 1 # a = a + 1과 같  

a = 1    
a -= 1 # a = a - 1과 같음   
print(a) = 0
```
# +=, -=, *=, /=, //=, %=, **=
